app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'thanh12@gmail.com' AND `users`.`password` = '123456' LIMIT 1
---
  def create
    @user = User.find_by(email: params[:email], password: params[:password])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def logout
    if session[:user_id]
      @user = User.find(session[:user_id])