app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `password`, `created_at`, `updated_at`) VALUES ('helomilo123@gmail.com', '123456', '2022-01-19 17:36:19.660987', '2022-01-19 17:36:19.660987')
---
  def create
    @user = User.new(data_params)
    if @user.save

SELECT `users`.* FROM `users` ORDER BY  id desc LIMIT 1
---
  def index
    @user = User.all.order(' id desc')
    @users = @user.limit(1)